using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace taskArray
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("M1.1. Заполнить массив из восьми элементов следующими значениями:" +
                "\nпервый элемент массива равен 37, второй — 0, третий — 50," +
                "\nчетвертый — 46, пятый — 34, шестой — 46," +
                "\nседьмой — 0, восьмой —13.");

            Console.WriteLine("М1.2. Заполнить массив из десяти элементов значениями, вводимыми с клавиатуры в ходе выполнения программы.");
            
            Console.WriteLine("М1.3. Заполнить массив из пятнадцати элементов случайным образом:" +
                "\r\nа) вещественными значениями, лежащими в диапазоне от 0 до 1;" +
                "\r\nб) вещественными значениями х (22 <= х < 23);" +
                "\r\nв) вещественными значениями х (0 <= х < 10);" +
                "\r\nг) вещественными значениями х (–50 <= х < 50);" +
                "\r\nд) целыми значениями, лежащими в диапазоне от 0 до 10 включительно.");
            
            Console.WriteLine("М1.4. Массив предназначен для хранения значений роста двенадцати человек." +
                "С помощью датчика случайных чисел заполнить массив целыми значениями, лежащими в диапазоне от 163 до 190 включительно.");
            
            Console.WriteLine("М1.5. Массив предназначен для хранения значений весов двадцати человек." +
                "С помощью датчика случайных чисел заполнить массив целыми значениями, лежащими в диапазоне от 50 до 100 включительно.");
            
            Console.WriteLine("М1.6. Заполнить массив из двенадцати элементов так: 1 2 … 12.");
            
            Console.WriteLine("М1.7. Заполнить массив из двадцати элементов так:  20 19 … 1.");
            
            Console.WriteLine("М1.8. Заполнить массив из восьми элементов таким образом," +
                "\nчтобы значения элементов при просмотре массива слева направо образовывали:" +
                "\r\nа) убывающую последовательность;\r\nб) возрастающую последовательность.\r\nВарианты, представленные в задачах" +
                "М1.6 и М1.7, не использовать.");
            
            Console.WriteLine("М1.9. Заполнить массив:\r\nа) десятью первыми членами арифметической прогрессии с известным первым членом прогрессии а" +
                "и ее разностью р;" +
                "\r\nб) двадцатью первыми членами геометрической прогрессии с известным первым членом прогрессии а и ее знаменателем z;" +
                "\r\nв) двенадцатью первыми членами последовательности Фибоначчи (последовательности, в которой первые два члена равны 1," +
                "\nа каждый следующий равен сумме двух предыдущих).");
            
            Console.WriteLine("М1.10. Дано натуральное число n (n <= 999999). Заполнить массив его цифрами, расположенными в обратном порядке" +
                "(первый элемент равен последней цифре, второй — предпоследней и т. д.). Незаполненные элементы массива должны быть равны нулю." +
                "Элементы массива, являющиеся цифрами числа n, вывести на экран.");
            
            Console.WriteLine("М1.11. Используя датчик случайных чисел, заполнить массив из двадцати элементов не повторяющимися числами.");
            
            Console.WriteLine("М1.12. Заполнить массив:\r\nа) двадцатью первыми натуральными числами, делящимися нацело на 13 или на 17 и находящимися" +
                "в интервале, левая граница которого равна 300;\r\nб) тридцатью первыми простыми числами (простым называется натуральное число," +
                "большее 1, не имеющее других делителей, кроме единицы и самого себя).");
            
            Console.WriteLine("М1.13. Составить программу вывода на экран любого элемента массива по его индексу.");
            
            Console.WriteLine("М1.14. Вывести элементы массива на экран в обратном порядке.");

            Console.ReadKey();
        }
    }
}
